import { Markup } from "telegraf";
import { BACK_MENU, TALK_TO_BOT_MENU } from "../../domain/constants/menuOptions.js";
import { showMainMenu } from "./menuHandlers.ts";

const instructions = {
  street: `🚶‍♂️ Якщо вас зупинили на вулиці:
1️⃣ Зберігайте спокій.
2️⃣ Запитайте підставу перевірки.
3️⃣ Маєте право не показувати документи без причини.
4️⃣ Можете фіксувати дії поліції на відео.`,
  car: `🚗 Якщо вас зупинили в автомобілі:
1️⃣ Ввімкніть аварійку та не виходьте з авто.
2️⃣ Вимагайте представитись та пояснити причину.
3️⃣ Не передавайте документи через вікно.
4️⃣ Маєте право вести відеозапис.`,
  home: `🏠 Якщо у вас обшук:
1️⃣ Вимагайте ухвалу суду.
2️⃣ Попросіть адвоката.
3️⃣ Знімайте відео, якщо можливо.
4️⃣ Не підписуйте документи, не прочитавши.`,
  other: `⚖️ Опишіть вашу ситуацію коротко, і я допоможу розібратись.`,
  chat: `⚖️ Опишіть вашу ситуацію якомога детальніше, і я допоможу розібратись.`,
};

export async function handleFlow(ctx, type) {
  await ctx.reply(instructions[type], Markup.keyboard([...BACK_MENU, ...TALK_TO_BOT_MENU]).resize());

  // Save user state (simple local map; can move to DB later)
  ctx.session ??= {};
  ctx.session.step = type;
}

export async function handleChat(ctx, type) {

  await ctx.reply(instructions[type], Markup.keyboard(BACK_MENU).resize());

  ctx.session ??= {};
  ctx.session.step = type;
}

export async function handleBackOrRestart(ctx) {
  const text = ctx.message.text;
  if (text === '🔙 Назад') {
    await showMainMenu(ctx);
    ctx.session.step = null;
  }
}
