import OpenAI from 'openai';
const openai = new OpenAI({ apiKey: process.env.OPENAI_API_KEY });

export async function askAI(userQuestion: string): Promise<string> {
  try {
    console.log('Запит в ШІ надіслано..')
    const completion = await openai.chat.completions.create({
      model: 'gpt-5-nano',
      messages: [
        { role: 'system', content: 'Ти висококласний професійний адвокат з громадянських прав в Україні. Поясни покроково, якщо вони порушують мої права (наприклад, просять показати документи, вимагають розблокувати телефон, проводять обшук без підстав, хамлять або затримують без пояснень) — напиши конкретні фрази з посиланням на відповідні статті законів України (Конституція, Закон «Про Національну поліцію», КПК, КУпАП, постанови КабМіну). Додай рекомендації, як законно зафіксувати порушення (відео, свідки, тощо). Формат відповіді - коротко до 4000 символів, чітко, структуровано' },
        { role: 'user', content: userQuestion }
      ],
    });

    return completion.choices[0]?.message?.content?.trim() || 'На жаль, я не маю відповіді на це питання.';

  } catch (err: any) {
    console.error('❌ AI request failed:', err);

    if (err instanceof OpenAI.APIError || err.status === 429) {
      return "Бот тимчасово недоступний через обмеження по запитах. Спробуйте пізніше або зверніться до адміністратора.";
    }

    // Handle known OpenAI API errors
    if (err instanceof OpenAI.APIError) {
      console.error('OpenAI API error:', {
        status: err.status,
        name: err.name,
        message: err.message,
        requestId: err.request_id,
      });
    }


    // Return a friendly fallback to user
    return (
      '⚠️ Вибачте, сталася технічна помилка при зверненні до AI.\n\n' +
      'Спробуйте, будь ласка, пізніше або зверніться до адміністратора:\n' +
      '📩 @legal_support_admin'
    );
  }
}
